/* 337A. Пазлы. - (https://codeforces.com/problemset/problem/337/A)
1) ограничение по времени на тест 1 секунда
2) ограничение по памяти на тест 256  мегабайт
3) ввод стандартный ввод
4) вывод стандартный вывод
*/

/*
Учебный год подходит к концу, и классной руководительнице Манане Тариеловне скоро придется прощаться с очередным классом. 
На прощанье учительница решила подарить каждому из своих n учеников «пазл» (согласно wikipedia, пазл — игра-головоломка, 
в которой требуется составить мозаику из множества фрагментов рисунка различной формы).

В магазине учительнице сказали, что у них есть m пазлов, но они возможно не все одинаковой сложности и размера. Конкретно, первый пазл состоял из f1 фрагментов, 
второй — из f2, и так далее.

Манана Тариеловна решила, что разница между количествами фрагментов в подаренных ею пазлах должна быть как можно меньше, иначе дети могут обидеться. 
Поэтому она хочет выбрать такие n пазлов, что если A — это количество фрагментов в самом большом, а B — количество фрагментов в самом маленьком из них, 
то A - B должно быть минимальным возможным. Помогите учительнице и найдите наименьшую возможную разницу A - B.
*/

/*
Входные данные
В первой строке через пробел записаны целые числа n и m (2 ≤ n ≤ m ≤ 50). 
Во второй строке через пробел записано m целых чисел f1, f2, ..., fm (4 ≤ fi ≤ 1000) — количества фрагментов в пазлах, продающихся в магазине.

Выходные данные
Выведите единственное целое число — минимальную возможную разницу между максимальным и минимальным количеством фрагментов среди пазлов, которые должна приобрести учительница.
*/

/* Примеры:
Входные данные:
4 6
10 12 10 7 5 22
Выходные данные:
5

Примечание:
Пример 1. В классе всего 4 ученика. В магазине продается 6 пазлов. Если Манана Тариеловна купит первые четыре пазла, которые состоят из 10, 12, 10 и 7 фрагментов соответственно, 
тогда разница между самым большим и самым маленьким будет равна 5-ти. Меньшую разницу получить невозможно. Заметим, 
что учительница может купить пазлы 1, 3, 4 и 5 и также получить разницу 5.
*/

#include <iostream>
#include <algorithm>
int main()
{
   int k, n, m = 0, r;
   std::cin >> k >> n;
   int *arr = new int[n];
   for (int i = 0; i < n; i++)
   {
      std::cin >> arr[i];
   }

   std::sort(arr, arr + n);
   m = arr[n - 1] - arr[0];

   for (int i = k; i <= n; i++)
   {
      r = arr[i - 1] - arr[i - k];
      r = abs(r);
      m = std::min(m, r);
   }

   std::cout << m;
   delete[] arr;
   return 0;
}
